export interface Category {
  id: number;
  name: string;
  slug: string;
  sub: string[];
}

export const catalogData: Category[] = [
  {
    id: 1,
    name: "Видеонаблюдение",
    slug: "videonablyudenie",
    sub: ["Камеры", "Регистраторы", "Микрофоны", "Монтажные коробки", "Кронштейны"]
  },
  {
    id: 2,
    name: "Сетевое оборудование",
    slug: "setevoe-oborudovanie",
    sub: ["Коммутаторы", "Маршрутизаторы", "Роутеры", "Wi-fi точки", "SFP модули", "PoE инжекторы", "Антенны", "Погружная телеметрия"]
  },
  {
    id: 3,
    name: "СКУД",
    slug: "skud",
    sub: ["Считыватели", "Контроллеры", "Бесконтактные ключи", "Замки", "Доводчики", "Металлодетекторы", "Турникеты", "Шлагбаумы", "Интроскопы"]
  },
  {
    id: 4,
    name: "Домофония",
    slug: "domofoniya",
    sub: ["Smart панели", "Видеомониторы", "Вызывные панели", "Аксессуары"]
  },
  {
    id: 5,
    name: "Сигнализация",
    slug: "signalizatsiya",
    sub: ["Контроллеры", "Источники питания", "Извещатели", "Пульты управления", "Брелоки", "Кнопки", "Ретрансляторы", "Датчики", "Модули", "Реле", "Розетки"]
  },
  {
    id: 6,
    name: "Шкафы",
    slug: "shkafy",
    sub: ["Оболочки", "Монтажные", "Климатические", "Телекоммуникационные", "Серверные", "Щиты и боксы", "Аптечные"]
  },
  {
    id: 7,
    name: "HDD",
    slug: "hdd",
    sub: ["Для видеосистем", "Для серверов", "Внешние диски", "SSD накопители"]
  }
];
