// menu-data.ts
export interface Category {
  id: number;
  name: string;
  slug: string;
  sub: string[];
}

export const catalogData: Category[] = [
  {
    id: 1,
    name: "Видеонаблюдение",
    slug: "videonablyudenie",
    sub: ["Камеры", "Регистраторы", "Микрофоны", "Монтажные коробки", "Кронштейны"]
  },
  {
    id: 2,
    name: "Тепловизоры",
    slug: "teplovizory",
    sub: ["Камеры тепловизионные", "Ручные тепловизоры", "Мобильные тепловизоры"]
  },
  {
    id: 3,
    name: "HDD",
    slug: "hdd",
    sub: ["HDD для видеонаблюдения", "HDD для серверов", "SSD", "NAS HDD", "Внешние HDD"]
  },
  {
    id: 4,
    name: "Сетевое оборудование",
    slug: "setevoe-oborudovanie",
    sub: [
      "Коммутаторы",
      "Маршрутизаторы",
      "Роутеры Micro-Drive",
      "Wi-Fi точки",
      "SFP модули",
      "Аксессуары",          // ← переименовано
      "Антенны",
      "Погружная телеметрия"
    ]
  },
  {
    id: 5,
    name: "СКУД",
    slug: "skud",
    sub: ["Считыватели", "Контроллеры", "Бесконтактные ключи", "Замки", "Доводчики", "Металлодетекторы", "Турникеты", "Шлагбаумы", "Интроскопы"]
  },
  {
    id: 6,
    name: "Домофония",
    slug: "domofoniya",
    sub: ["Smart панели", "Видеомониторы", "Вызывные панели", "Аксессуары"]
  },
  {
    id: 7,
    name: "Сигнализация",
    slug: "signalizatsiya",
    sub: ["Контроллеры", "Источники питания", "Извещатели", "Пульты управления", "Ретрансляторы", "Датчики", "Модули", "Реле", "Розетки"]
  },
  {
    id: 8,
    name: "Шкафы",
    slug: "shkafy",
    sub: ["Монтажные и оболочки", "Климатические", "Телекоммуникационные", "Серверные", "Аптечные", "Аксессуары шкафов"]
  }
];